{
  "header": {
    "home": "Home",
    "exampleApp": "Example App",
    "homeShort": "Home",
    "exampleAppShort": "App",
    "chat": "Chat"
  },
  "recordsTable": {
    "header": "Records Table",
    "description-1": "Below you can find the records table and a simple form for adding new ones. The goal of this example was to create a simple part that is present in most applications, i.e. a form for adding data, a place where it is displayed, and the possibility of editing and deleting. The components were created according to ",
    "description-2": ". The form is validated on the frontend and backend. All operations are saved in server logs. In the project, storybook was added on the frontend side and swagger on the backend side for documentation purposes (both technologies are available only in the developers' environment).",
    "loading": " Loading...",
    "error": "Error: ",
    "tableHeaders": {
      "id": "Id",
      "accountNumber": "Account Number",
      "accountName": "Account Name",
      "iban": "IBAN",
      "address": "Address",
      "amount": "Amount",
      "type": "Type",
      "action": "Action"
    },
    "tableNavigation": {
      "showing": "Showing",
      "of": "of",
      "previous": "Previous",
      "next": "Next"
    },
    "noRecords": "This page is empty!",
    "form": {
      "modalFields": {
        "accountNumber": "Account Number",
        "accountName": "Account Name",
        "iban": "IBAN",
        "address": "Address",
        "amount": "Amount",
        "type": "Type",
        "action": "Action",
        "validationSchema": {
          "accountNumberRequired": "Account Number is required",
          "accountNumberDigits": "Account Number must contain only digits",
          "accountNameRequired": "Account Name is required",
          "ibanLength": "IBAN has to have 32 letters",
          "ibanFormat": "IBAN must start with two capital letters followed by up to 30 alphanumeric characters",
          "addressRequired": "Address is required",
          "amountNumber": "Amount must be a number",
          "amountPositive": "Amount must be greater than zero",
          "typeRequired": "Type is required",
          "typeSending": "Sending",
          "typeReceiving": "Receiving",
          "typeUnknown": "Unknown"
        }
      },
      "addForm": {
        "header": "Add record",
        "button": "Add record"
      },
      "editForm": {
        "header": "Edit record",
        "button": "Edit record"
      },
      "removeForm": {
        "header": "Remove record",
        "confirmationHeader": "Are you sure you want to delete record?",
        "button": "Remove Record"
      }
    },
    "addRecordButton": "Add Record"
  },
  "homePage": {
    "header": "Hi there, I’m",
    "name": "Karol",
    "description": "For the past 6 years, I have focused on web technologies, working with clients from Finland, Lithuania, Germany, France, Italy and US. As a technical specialist, I engage directly with clients, providing ongoing technical support and programming services. I am an ambitious, fast-learning, and always motivated individual with a strong passion for technology.",
    "projects": {
      "headerPart1": "Recent",
      "headerPart2": "Projects",
      "roche": {
        "role": "Full-Stack Developer",
        "company": "Roche via Square One",
        "description": "Projected system architecture and developed an application from scratch using AWS SDK (IaC): DynamoDB, Serverless Lambdas, OpenSearch, S3, Route53, Amplify, AppSync, SES, CloudWatch and SQS. Implemented a CI/CD pipeline with GitHub, enabling 3-level deployment with automated linting, builds, unit/E2E tests across 3 AWS accounts. Mentored team members and participated in global planning."
      },
      "finelf": {
        "role": "Full-Stack Developer",
        "company": "Finelf",
        "description": "Developed and optimized a credit ranking app (2M visitors/year), improving performance by 30% and enhancing SEO results within 3 months. Maintained a Node.js CMS with React and TypeScript, hosted on AWS (EC2, Route53, RDS, S3). Contributed to fin-tech applications and helped migrate apps from software houses to modern stacks."
      },
      "valmet": {
        "role": "Mid Front-End Developer",
        "company": "Valmet via Unikie",
        "description": "Developed a high-performance factory control application (React, TypeScript, Sass) with strict safety and performance requirements. Worked with Python for testing, Storybook, Jenkins, Kubernetes, and Docker. Contributed to a VR/browser e-meetings app (React, TypeScript, WebRTC, Three.js, WebSockets)."
      },
      "privateCustomer": {
        "role": "Full-Stack Developer (Contract)",
        "company": "Private Client",
        "description": "Built an e-commerce platform for a clothing brand using Next.js, React, TypeScript, Tailwind, and MongoDB. Managed DevOps (local servers, Docker) and maintained direct client communication."
      },
      "railwaymen": {
        "role": "Junior Front-End Developer",
        "company": "Railwaymen",
        "description": "Developed an accounting app for the UK market (React, Sass, Storybook) and worked on a time scheduling app (React, TypeScript, SCSS, GitLab)."
      },
      "automation": {
        "role": "IT / OT Specialist",
        "company": "ATREM, DUNI, MONDI",
        "description": "Worked as automation specialist programming logic controllers (PLC) and operator panels (HMI) devices. Participated in international projects in industrial automation."
      }
    }
  },
  "chat": {
    "header": "AI Assistant",
    "description": "AI-powered assistant chat developed using Django, Ollama, and the Mistral language model. Inspired by ChatGPT, the app enables interactive and intuitive conversations with users, providing intelligent and context-aware responses. It combines a robust backend framework with state-of-the-art natural language processing technology to deliver a seamless and engaging user experience.",
    "reminder": "Please keep in mind that this is a Proof of Concept (PoC). It is hosted on a private server with limited resources, so performance may vary. Response times can range from 30 to 60 seconds depending on server load. All DevOps and security configurations were implemented by me from scratch. Thank you for your understanding!",
    "placeholder": "Type your prompt...",
    "chatLabel": "Chat message",
    "send": "Send",
    "assistant": "Assistant",
    "user": "You"
  },
  "footer": {
    "copyrightName": "Karlos97.",
    "copyrightRights": "All rights reserved."
  },
  "atoms": {
    "select": {
      "selectAnOption": "Select an option"
    }
  }
}