{
  "header": {
    "home": "Strona Główna",
    "exampleApp": "Przykładowa Aplikacja",
    "homeShort": "Start",
    "exampleAppShort": "App",
    "chat": "Chat App"
  },
  "recordsTable": {
    "header": "Tablica wpisów",
    "description-1": "Poniżej znajduje się tabela wpisów oraz prosty formularz dodawania nowych. Celem tego przykładu było stworzenie prostego skrawka, który występuje w większości aplikacji, czyli formularza dodającego dane, miejsca, w którym się je wyświetla, oraz możliwości edycji i usuwania. Komponenty zostały stworzone zgodnie z ",
    "description-2": ". Formularz jest walidowany po stronie frontendu oraz backendu. Wszystkie operacje zapisywane są w logach serwera. W projekcie został dodany storybook po stronie frontendu oraz swagger po stronie backendu w ramach dokumentacji (obydwie technologie dostępne są tylko w środowisku developerskim).",
    "loading": "Ładowanie...",
    "error": "Błąd: ",
    "tableHeaders": {
      "id": "Id",
      "accountNumber": "Numer konta",
      "accountName": "Nazwa konta",
      "iban": "IBAN",
      "address": "Adres",
      "amount": "Kwota",
      "type": "Typ",
      "action": "Akcja"
    },
    "tableNavigation": {
      "showing": "Pokazuję",
      "of": "z",
      "previous": "Poprzedni",
      "next": "Następny"
    },
    "noRecords": "Tabela nie zawiera żadnych wpisów!",
    "form": {
      "modalFields": {
        "accountNumber": "Numer konta",
        "accountName": "Nazwa konta",
        "iban": "IBAN",
        "address": "Adres",
        "amount": "Kwota",
        "type": "Typ",
        "action": "Akcja",
        "validationSchema": {
          "accountNumberRequired": "Numer konta jest wymagany",
          "accountNumberDigits": "Numer konta musi zawierać tylko cyfry",
          "accountNameRequired": "Nazwa konta jest wymagana",
          "ibanLength": "IBAN musi mieć 32 znaki",
          "ibanFormat": "IBAN musi zaczynać się od dwóch wielkich liter, a następnie 30 znaków alfanumerycznych",
          "addressRequired": "Adres jest wymagany",
          "amountNumber": "Kwota musi być liczbą",
          "amountPositive": "Kwota musi być większa od zera",
          "typeRequired": "Typ przelewu jest wymagany",
          "typeSending": "Wysyłanie",
          "typeReceiving": "Odbieranie",
          "typeUnknown": "Nieznany"
        }
      },
      "addForm": {
        "header": "Dodaj wpis",
        "button": "Dodaj wpis"
      },
      "editForm": {
        "header": "Edytuj wpis",
        "button": "Edytuj wpis"
      },
      "removeForm": {
        "header": "Usuń wpis",
        "confirmationHeader": "Czy na pewno chcesz usunąć ten wpis?",
        "button": "Usuń wpis"
      }
    },
    "addRecordButton": "Dodaj wpis"
  },
  "homePage": {
    "header": "Cześć, jestem",
    "name": "Karol",
    "description": "W przeszłości pracowałem z klientami z Finlandii, Litwy, Niemiec, Francji i Włoch. Kierowałem instalacjami maszyn przemysłowych jako klient, oraz jako specjalista techniczny, bezpośrednio współpracowałem z klientami, oferując wsparcie techniczne i usługi programistyczne. Od kilku lat zajmuję się tym samym charakterem działalności, tj. doradztwem i usługami programistycznymi, jednakże w branży webowej.",
    "projects": {
      "headerPart1": "Ostatnie",
      "headerPart2": "Projekty",
      "finelf": {
        "role": "Fullstack Developer",
        "company": "Finelf",
        "description": "Pracowałem nad rankomatem(ranking kredytowy) z 2 milionami odwiedzin rocznie, poprawiając wydajność o ~30% w ciągu 3 miesięcy, poprawiając wyniki SEO oraz z backendem Node.js (używając MongoDB i PostgreSQL jako CMS), hostowaną na AWS, jednocześnie zarządzając hostingiem stron WordPress. Technologie obejmowały Swagger, React, MUI, AWS i inne."
      },
      "unikie": {
        "role": "Mid Frontend Developer",
        "company": "Unikie",
        "description": "Pracowałem nad aplikacją do kontroli fabryki, skupiając się na wydajności i bezpieczeństwie, używając React, TypeScript, Sass, Pythona (do testowania), Storybook, Jenkins, DevOps, Kubernetes, Docker, Jira i BitBucket, z bezpośrednim kontaktem z klientem. Współtworzyłem również aplikację do E-meetingów (zdalnych rozmów), wykorzystując React, TypeScript, CSS-in-JS, Formik, RHF, Docker, WebRTC, Three.js, SignalR, WebSockets, REST API, Postman, Swagger i w małym stopniu Azure."
      },
      "privateCustomer": {
        "role": "Fullstack Developer",
        "company": "Klient prywatny",
        "description": "Opracowałem stronę e-commerce do sprzedaży ubrań, współpracując bezpośrednio z klientem, używając Next.js, React, TypeScript, Sass, Tailwind, Docker, DevOps (lokalne serwery, sieci), Node.js, MongoDB i REST API."
      },
      "railwaymen": {
        "role": "Jr. Frontend Developer",
        "company": "Railwaymen",
        "description": "Pracowałem nad aplikacją księgową na rynek UK oraz aplikacją do planowania czasu, wykorzystując React, Sass, TypeScript, RHF, Storybook, Jira, GitLab, HAML, Rails, Emotion i SCSS."
      },
      "rest": {
        "role": "Branża automatyki",
        "company": "",
        "description": "Spędziłem 5 lat w branży automatyki jako specjalista ds. automatyzacji. Byłem odpowiedzialny za automatyzację procesów, tj. pisanie programów na PLC (sterowniki programowalne)."
      }
    }
  },
  "chat": {
    "header": "Asystent AI",
    "description": "Aplikacja ponizej to czat zasilony sztuczną inteligencją, opracowana z wykorzystaniem Django, Ollama i modelu językowego Mistral. Zainspirowana Chatem GPT, aplikacja umożliwia interaktywne i intuicyjne rozmowy z użytkownikami, oferując inteligentne i kontekstowo świadome odpowiedzi. Łączy solidne zaplecze technologiczne z najnowocześniejszą technologią przetwarzania języka naturalnego, zapewniając płynne i angażujące doświadczenie użytkownika.",
    "placeholder": "Zadaj pytanie...",
    "send": "Wyślij",
    "assistant": "Asystent",
    "user": "Ty"
  },
  "footer": {
    "copyrightName": "Karlos97.",
    "copyrightRights": "Wszystkie prawa zastrzeżone."
  },
  "atoms": {
    "select": {
      "selectAnOption": "Wybierz opcję"
    }
  }
}
