{
  "header": {
    "home": "Strona Główna",
    "exampleApp": "Przykładowa Aplikacja",
    "homeShort": "Start",
    "exampleAppShort": "App",
    "chat": "Chat"
  },
  "recordsTable": {
    "header": "Tablica wpisów",
    "description-1": "Poniżej znajduje się tabela wpisów oraz prosty formularz dodawania nowych. Celem tego przykładu było stworzenie prostego skrawka, który występuje w większości aplikacji, czyli formularza dodającego dane, miejsca, w którym się je wyświetla, oraz możliwości edycji i usuwania. Komponenty zostały stworzone zgodnie z ",
    "description-2": ". Formularz jest walidowany po stronie frontendu oraz backendu. Wszystkie operacje zapisywane są w logach serwera. W projekcie został dodany storybook po stronie frontendu oraz swagger po stronie backendu w ramach dokumentacji (obydwie technologie dostępne są tylko w środowisku developerskim).",
    "loading": "Ładowanie...",
    "error": "Błąd: ",
    "tableHeaders": {
      "id": "Id",
      "accountNumber": "Numer konta",
      "accountName": "Nazwa konta",
      "iban": "IBAN",
      "address": "Adres",
      "amount": "Kwota",
      "type": "Typ",
      "action": "Akcja"
    },
    "tableNavigation": {
      "showing": "Pokazuję",
      "of": "z",
      "previous": "Poprzedni",
      "next": "Następny"
    },
    "noRecords": "Tabela nie zawiera żadnych wpisów!",
    "form": {
      "modalFields": {
        "accountNumber": "Numer konta",
        "accountName": "Nazwa konta",
        "iban": "IBAN",
        "address": "Adres",
        "amount": "Kwota",
        "type": "Typ",
        "action": "Akcja",
        "validationSchema": {
          "accountNumberRequired": "Numer konta jest wymagany",
          "accountNumberDigits": "Numer konta musi zawierać tylko cyfry",
          "accountNameRequired": "Nazwa konta jest wymagana",
          "ibanLength": "IBAN musi mieć 32 znaki",
          "ibanFormat": "IBAN musi zaczynać się od dwóch wielkich liter, a następnie 30 znaków alfanumerycznych",
          "addressRequired": "Adres jest wymagany",
          "amountNumber": "Kwota musi być liczbą",
          "amountPositive": "Kwota musi być większa od zera",
          "typeRequired": "Typ przelewu jest wymagany",
          "typeSending": "Wysyłanie",
          "typeReceiving": "Odbieranie",
          "typeUnknown": "Nieznany"
        }
      },
      "addForm": {
        "header": "Dodaj wpis",
        "button": "Dodaj wpis"
      },
      "editForm": {
        "header": "Edytuj wpis",
        "button": "Edytuj wpis"
      },
      "removeForm": {
        "header": "Usuń wpis",
        "confirmationHeader": "Czy na pewno chcesz usunąć ten wpis?",
        "button": "Usuń wpis"
      }
    },
    "addRecordButton": "Dodaj wpis"
  },
  "homePage": {
    "header": "Cześć, jestem",
    "name": "Karol",
    "description": "Przez ostatnie 6 lat skupiłem się na technologiach webowych, współpracując z klientami z Finlandii, Litwy, Niemiec, Francji, Włoch i USA. Jako specjalista techniczny, bezpośrednio współpracuję z klientami, oferując bieżące wsparcie techniczne i usługi programistyczne. Jestem ambitną, szybko uczącą się i zawsze zmotywowaną osobą z silną pasją do technologii.",
    "projects": {
      "headerPart1": "Ostatnie",
      "headerPart2": "Projekty",
      "roche": {
        "role": "Full-Stack Developer",
        "company": "Roche via Square One",
        "description": "Zaprojektowałem architekturę systemu i rozwinąłem aplikację od podstaw używając AWS SDK (IaC): DynamoDB, Serverless Lambdas, OpenSearch, S3, Route53, Amplify, AppSync, SES, CloudWatch i SQS. Wdrożyłem pipeline CI/CD z GitHub, umożliwiając 3-poziomowy deployment z automatycznym lintingiem, buildami, testami unit/E2E na 3 oddzielnych kontach AWS. Mentorowałem członków zespołu i uczestniczyłem w globalnym planowaniu."
      },
      "finelf": {
        "role": "Full-Stack Developer",
        "company": "Finelf",
        "description": "Rozwijałem i optymalizowałem aplikację rankingu kredytowego (2M odwiedzających/rok), poprawiając wydajność o 30% i wyniki SEO w ciągu 3 miesięcy. Utrzymywałem CMS Node.js z React i TypeScript, hostowany na AWS (EC2, Route53, RDS, S3). Współtworzyłem aplikacje fin-tech i pomagałem w migracji aplikacji z software house'ów do nowoczesnych stacków."
      },
      "valmet": {
        "role": "Mid Front-End Developer",
        "company": "Valmet via Unikie",
        "description": "Rozwijałem wysokowydajną aplikację kontroli fabryki (React, TypeScript, Sass) z surowymi wymaganiami bezpieczeństwa i wydajności. Pracowałem z Pythonem do testowania, Storybook, Jenkins, Kubernetes i Docker. Współtworzyłem aplikację VR/browser do e-meetingów (React, TypeScript, WebRTC, Three.js, WebSockets)."
      },
      "privateCustomer": {
        "role": "Full-Stack Developer (Kontrakt)",
        "company": "Klient prywatny",
        "description": "Zbudowałem platformę e-commerce dla marki odzieżowej używając Next.js, React, TypeScript, Tailwind i MongoDB. Zarządzałem DevOps (lokalne serwery, Docker) i utrzymywałem bezpośrednią komunikację z klientem."
      },
      "railwaymen": {
        "role": "Junior Front-End Developer",
        "company": "Railwaymen",
        "description": "Rozwijałem aplikację księgową na rynek UK (React, Sass, Storybook) i pracowałem nad aplikacją do planowania czasu (React, TypeScript, SCSS, GitLab)."
      },
      "automation": {
        "role": "Specjalista IT / OT",
        "company": "ATREM, DUNI, MONDI",
        "description": "Pracowałem jako specjalista automatyki programując sterowniki logiczne (PLC) i panele operatorskie (HMI). Uczestniczyłem w międzynarodowych projektach automatyki przemysłowej."
      }
    }
  },
  "chat": {
    "header": "Asystent AI",
    "description": "Aplikacja ponizej to czat zasilony sztuczną inteligencją, opracowana z wykorzystaniem Django, Ollama i modelu językowego Mistral. Zainspirowana Chatem GPT, aplikacja umożliwia interaktywne i intuicyjne rozmowy z użytkownikami, oferując inteligentne i kontekstowo świadome odpowiedzi. Łączy solidne zaplecze technologiczne z najnowocześniejszą technologią przetwarzania języka naturalnego, zapewniając płynne i angażujące doświadczenie użytkownika.",
    "reminder": "Proszę pamiętać, że to tylko Proof of Concept (PoC). Aplikacja jest hostowana na prywatnym serwerze o ograniczonych zasobach, więc wydajność może być różna. Czas odpowiedzi może wynosić od 30 do 60 sekund w zależności od obłożenia serwera. Cała konfiguracja DevOps oraz zabezpieczenia zostały przeze mnie zaimplementowane od zera. Dziękuję za zrozumienie!",
    "placeholder": "Zadaj pytanie...",
    "chatLabel": "Wiadomość",
    "send": "Wyślij",
    "assistant": "Asystent",
    "user": "Ty"
  },
  "footer": {
    "copyrightName": "Karlos97.",
    "copyrightRights": "Wszystkie prawa zastrzeżone."
  },
  "atoms": {
    "select": {
      "selectAnOption": "Wybierz opcję"
    }
  }
}